Рабочая.Задачи2/src/Catalogs/ЦБР_СтруктураЗадач/ЦБР_СтруктураЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_СтруктураЗадач</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЦБР_Задача</owners>
  <attributes>
    <name>КодСДР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияВУровне</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗадание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
</mdclass:Catalog>

Рабочая.Задачи2/src/Catalogs/ЦБР_СтруктураЗадач/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодСДР) Тогда
		ДанныеКода = ПолучитьКодСДРИНомерЗадачиВУровне(Владелец, Родитель);
		КодСДР = ДанныеКода.НомерЗадачиВУровне;
		НомерЗаданияВУровне = Формат(ДанныеКода.КодСДР,"ЧРД=.");
	КонецЕсли;
		
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ПолучитьНомерЗаданияВУровне(Задание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦБР_СтруктураЗадач.Ссылка,
	|	ЦБР_СтруктураЗадач.НомерЗаданияВУровне КАК НомерЗаданияВУровне
	|ИЗ
	|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
	|ГДЕ
	|	ЦБР_СтруктураЗадач.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаданияВУровне УБЫВ";
	Запрос.Параметры.Вставить("Родитель", Задание.Родитель);
	
	РезультатВыборки = Запрос.Выполнить().Выбрать();
	Если РезультатВыборки.Следующий() Тогда
		Если ЗначениеЗаполнено(РезультатВыборки.НомерЗаданияВУровне) Тогда
			Номер = РезультатВыборки.НомерЗаданияВУровне;
			НомерЗаданияВУровне = Строка(Число(Номер) + 1);
			Возврат НомерЗаданияВУровне;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

// Возвращает Код СДР и номер проектной задачи
Функция ПолучитьКодСДРИНомерЗадачиВУровне(Задача, Родитель) Экспорт 
	
	МаксимальныйНомер = ПолучитьМаксимальныйНомерЗадачиУровня(Задача, Родитель);
	
	КодСДРСтрока = "";
	Если ЗначениеЗаполнено(Родитель) Тогда
		КодСДРСтрока = Родитель.НомерЗаданияВУровне;	
	КонецЕсли;
	
	НомерЗадачиВУровне = Число(МаксимальныйНомер) + 1;
	КодСДР = КодСДРСтрока
	+ ?(ЗначениеЗаполнено(КодСДРСтрока), ".", "")
	+ Строка(НомерЗадачиВУровне);
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("КодСДР", КодСДР);
	ДанныеВозврата.Вставить("НомерЗадачиВУровне", НомерЗадачиВУровне);
	
	Возврат ДанныеВозврата;
	
КонецФункции


// Возвращает максимальный номер проектной задачи в пределах родителя 
Функция ПолучитьМаксимальныйНомерЗадачиУровня(Проект, Родитель)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ПроектныеЗадачи.КодСДР), 0) КАК КодСДР
	|ИЗ
	|	Справочник.ЦБР_СтруктураЗадач КАК ПроектныеЗадачи
	|ГДЕ
	|	ПроектныеЗадачи.Владелец = &Проект
	|	И ПроектныеЗадачи.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КодСДР;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти
